contiki-ng/contiki-ng/arch/cpu/nrf/nrf54l15/nrf_802154_platform_sl_lptimer.c
/*
 * Copyright (c) 2026, RISE Research Institutes of Sweden AB
 * All rights reserved.
 *
 * Author: Joakim Eriksson <joakim.eriksson@ri.se>
 *
 * SPDX-License-Identifier: BSD-3-Clause
 *
 * Low Power Timer + SL Timer + Timer Coordinator for nrf_802154 on nRF54L15.
 *
 * The application core on nRF54L15 does not expose a classic RTC instance,
 * so this backend uses TIMER20 at 1 MHz instead. The scheduling semantics
 * preserved here -- safe compare programming, exact-vs-adjusted scheduling,
 * pending IRQ replay after critical sections, and a dedicated hardware-task
 * compare channel -- are inspired by Zephyr's nrf_rtc_timer.
 */

#include "nrf_802154_sl_timer.h"
#include "platform/nrf_802154_platform_sl_lptimer.h"
#include "timer/nrf_802154_timer_coord.h"
#include "helpers/nrfx_gppi.h"
#include "hal/nrf_timer.h"
#include "nrf.h"

#include <stdbool.h>
#include <stdint.h>

#define LP_TIMER               NRF_TIMER20
#define LP_TIMER_IRQn          TIMER20_IRQn
#define LP_TIMER_IRQ_PRIORITY  1

#define CAPTURE_CC             0
#define ALARM_CC               1
#define SYNC_CC                2
#define HW_TASK_CC             3

#define COUNTER_HALF_SPAN      (UINT64_C(1) << 31)
#define COUNTER_WRAP           (UINT64_C(1) << 32)
#define MIN_TICKS_FROM_NOW     8U
#define SYNC_MARGIN_TICKS      8U

#define FORCE_MASK_ALARM       (1UL << ALARM_CC)
#define FORCE_MASK_SYNC        (1UL << SYNC_CC)

static volatile bool alarm_pending;
static volatile bool sync_pending;
static uint32_t critical_section_depth;
static uint32_t force_isr_mask;

/* Active software timers, ordered by trigger_time. */
static nrf_802154_sl_timer_t *alarm_head;
static uint64_t alarm_target_lpticks;
static uint64_t sync_fire_lpticks;

enum hw_task_state {
  HW_TASK_STATE_IDLE,
  HW_TASK_STATE_SETTING_UP,
  HW_TASK_STATE_READY,
  HW_TASK_STATE_UPDATING,
  HW_TASK_STATE_CLEANING,
};

static enum hw_task_state hw_task_state;
static uint32_t hw_task_ppi_channel = NRF_802154_SL_HW_TASK_PPI_INVALID;
static uint64_t hw_task_fire_lpticks;

static bool timer_initialized;
static uint64_t timer_time_upper;
static uint32_t timer_last_low;
/*---------------------------------------------------------------------------*/
static inline uint32_t
irq_lock_local(void)
{
  uint32_t primask = __get_PRIMASK();

  __disable_irq();
  __DMB();

  return primask;
}
/*---------------------------------------------------------------------------*/
static inline void
irq_unlock_local(uint32_t primask)
{
  __DMB();
  __set_PRIMASK(primask);
}
/*---------------------------------------------------------------------------*/
static inline nrf_802154_sl_timer_t *
timer_next_get(nrf_802154_sl_timer_t *timer)
{
  return (nrf_802154_sl_timer_t *)(uintptr_t)timer->priv.placeholder[0];
}
/*---------------------------------------------------------------------------*/
static inline void
timer_next_set(nrf_802154_sl_timer_t *timer, nrf_802154_sl_timer_t *next)
{
  timer->priv.placeholder[0] = (uint64_t)(uintptr_t)next;
}
/*---------------------------------------------------------------------------*/
static inline bool
timer_is_active(nrf_802154_sl_timer_t *timer)
{
  return timer->priv.placeholder[1] != 0U;
}
/*---------------------------------------------------------------------------*/
static inline void
timer_active_set(nrf_802154_sl_timer_t *timer, bool active)
{
  timer->priv.placeholder[1] = active ? 1U : 0U;
}
/*---------------------------------------------------------------------------*/
__attribute__((weak)) void
nrf_802154_sl_timestamper_synchronized(void)
{
}
/*---------------------------------------------------------------------------*/
static inline bool
hw_task_state_set_locked(enum hw_task_state expected, enum hw_task_state new_state)
{
  if(hw_task_state != expected) {
    return false;
  }

  hw_task_state = new_state;
  return true;
}
/*---------------------------------------------------------------------------*/
static inline uint32_t
timer_event_address_get(uint8_t cc_channel)
{
  return nrf_timer_event_address_get(LP_TIMER, nrf_timer_compare_event_get(cc_channel));
}
/*---------------------------------------------------------------------------*/
static inline bool
timer_event_check_cc(uint8_t cc_channel)
{
  return nrf_timer_event_check(LP_TIMER, nrf_timer_compare_event_get(cc_channel));
}
/*---------------------------------------------------------------------------*/
static inline void
timer_event_clear_cc(uint8_t cc_channel)
{
  nrf_timer_event_clear(LP_TIMER, nrf_timer_compare_event_get(cc_channel));
}
/*---------------------------------------------------------------------------*/
static inline uint32_t
timer_int_mask_get(uint8_t cc_channel)
{
  return nrf_timer_compare_int_get(cc_channel);
}
/*---------------------------------------------------------------------------*/
static inline void
timer_compare_int_enable(uint8_t cc_channel)
{
  nrf_timer_int_enable(LP_TIMER, timer_int_mask_get(cc_channel));
}
/*---------------------------------------------------------------------------*/
static inline void
timer_compare_int_disable(uint8_t cc_channel)
{
  nrf_timer_int_disable(LP_TIMER, timer_int_mask_get(cc_channel));
}
/*---------------------------------------------------------------------------*/
static inline bool
timer_compare_int_lock(uint8_t cc_channel)
{
  bool enabled = (nrf_timer_int_enable_check(LP_TIMER, timer_int_mask_get(cc_channel)) != 0U);

  timer_compare_int_disable(cc_channel);
  __DMB();
  __ISB();

  return enabled;
}
/*---------------------------------------------------------------------------*/
static inline void
timer_compare_int_unlock(uint8_t cc_channel, bool key)
{
  if(key) {
    timer_compare_int_enable(cc_channel);
    if(force_isr_mask & (1UL << cc_channel)) {
      NVIC_SetPendingIRQ(LP_TIMER_IRQn);
    }
  }
}
/*---------------------------------------------------------------------------*/
static inline uint64_t
timer_time_get_locked(void)
{
  uint32_t low;

  nrf_timer_task_trigger(LP_TIMER, nrf_timer_capture_task_get(CAPTURE_CC));
  low = nrf_timer_cc_get(LP_TIMER, NRF_TIMER_CC_CHANNEL0);

  if(low < timer_last_low) {
    timer_time_upper += COUNTER_WRAP;
  }

  timer_last_low = low;

