contiki-ng/contiki-ng/arch/cpu/nrf/nrf54l15/nrf_802154_platform_sl_lptimer.c
  return timer_time_upper | low;
}
/*---------------------------------------------------------------------------*/
static uint64_t
timer_time_get(void)
{
  uint32_t primask = irq_lock_local();
  uint64_t now = timer_time_get_locked();
  irq_unlock_local(primask);
  return now;
}
/*---------------------------------------------------------------------------*/
static inline bool
target_is_too_distant(uint64_t now, uint64_t target)
{
  return (target > now) && ((target - now) > COUNTER_HALF_SPAN);
}
/*---------------------------------------------------------------------------*/
static int
timer_compare_set_locked(uint8_t cc_channel, uint64_t target, bool exact)
{
  uint64_t now = timer_time_get_locked();

  if(target_is_too_distant(now, target)) {
    return -1;
  }

  if(target <= now) {
    if(exact) {
      return -1;
    }

    force_isr_mask |= (1UL << cc_channel);
    timer_event_clear_cc(cc_channel);
    return 0;
  }

  {
    uint32_t low_now = (uint32_t)now;
    uint32_t cc_value = (uint32_t)target;
    uint32_t min_cc = low_now + MIN_TICKS_FROM_NOW;

    if((int32_t)(cc_value - min_cc) <= 0) {
      if(exact) {
        return -1;
      }

      cc_value = min_cc;
    }

    force_isr_mask &= ~(1UL << cc_channel);
    timer_event_clear_cc(cc_channel);
    nrf_timer_cc_set(LP_TIMER, (nrf_timer_cc_channel_t)cc_channel, cc_value);
  }

  return 0;
}
/*---------------------------------------------------------------------------*/
static inline bool
hw_task_triggered_check_locked(uint64_t now)
{
  return timer_event_check_cc(HW_TASK_CC) || now >= hw_task_fire_lpticks;
}
/*---------------------------------------------------------------------------*/
static inline void
hw_task_ppi_bind_locked(uint32_t ppi_channel)
{
  if(ppi_channel == NRF_802154_SL_HW_TASK_PPI_INVALID) {
    return;
  }

  nrfx_gppi_event_endpoint_setup((uint8_t)ppi_channel, timer_event_address_get(HW_TASK_CC));
}
/*---------------------------------------------------------------------------*/
static inline void
hw_task_ppi_unbind_locked(uint32_t ppi_channel)
{
  if(ppi_channel == NRF_802154_SL_HW_TASK_PPI_INVALID) {
    return;
  }

  nrfx_gppi_event_endpoint_clear((uint8_t)ppi_channel, timer_event_address_get(HW_TASK_CC));
}
/*---------------------------------------------------------------------------*/
static void
alarm_reschedule_locked(void)
{
  if(alarm_head == NULL) {
    alarm_pending = false;
    alarm_target_lpticks = 0;
    force_isr_mask &= ~FORCE_MASK_ALARM;
    timer_compare_int_disable(ALARM_CC);
    timer_event_clear_cc(ALARM_CC);
    return;
  }

  alarm_pending = true;
  alarm_target_lpticks = alarm_head->trigger_time;

  (void)timer_compare_set_locked(ALARM_CC, alarm_target_lpticks, false);

  if(critical_section_depth == 0U) {
    timer_compare_int_enable(ALARM_CC);
    if((force_isr_mask & FORCE_MASK_ALARM) != 0U) {
      NVIC_SetPendingIRQ(LP_TIMER_IRQn);
    }
  }
}
/*---------------------------------------------------------------------------*/
static void
sync_schedule_locked(uint64_t fire_lpticks)
{
  sync_pending = true;
  sync_fire_lpticks = fire_lpticks;

  (void)timer_compare_set_locked(SYNC_CC, sync_fire_lpticks, false);

  if(critical_section_depth == 0U) {
    timer_compare_int_enable(SYNC_CC);
    if((force_isr_mask & FORCE_MASK_SYNC) != 0U) {
      NVIC_SetPendingIRQ(LP_TIMER_IRQn);
    }
  }
}
/*---------------------------------------------------------------------------*/
static nrf_802154_sl_timer_ret_t
timer_remove_locked(nrf_802154_sl_timer_t *timer)
{
  nrf_802154_sl_timer_t *prev = NULL;
  nrf_802154_sl_timer_t *curr = alarm_head;

  while(curr != NULL) {
    if(curr == timer) {
      nrf_802154_sl_timer_t *next = timer_next_get(curr);

      if(prev == NULL) {
        alarm_head = next;
      } else {
        timer_next_set(prev, next);
      }

      timer_next_set(curr, NULL);
      timer_active_set(curr, false);
      alarm_reschedule_locked();
      return NRF_802154_SL_TIMER_RET_SUCCESS;
    }

    prev = curr;
    curr = timer_next_get(curr);
  }

  return NRF_802154_SL_TIMER_RET_INACTIVE;
}
/*---------------------------------------------------------------------------*/
static void
alarm_process(void)
{
  while(true) {
    nrf_802154_sl_timer_t *timer;
    uint32_t primask = irq_lock_local();
    uint64_t now = timer_time_get_locked();

    timer = alarm_head;

    if(timer == NULL) {
      alarm_pending = false;
      alarm_target_lpticks = 0;
      irq_unlock_local(primask);
      break;
    }

    if(timer->trigger_time > now) {
      alarm_reschedule_locked();
      irq_unlock_local(primask);
      break;
    }

    alarm_head = timer_next_get(timer);
    timer_next_set(timer, NULL);
    timer_active_set(timer, false);
    alarm_reschedule_locked();

    irq_unlock_local(primask);

    if((timer->action_type & NRF_802154_SL_TIMER_ACTION_TYPE_CALLBACK) &&
       timer->action.callback.callback != NULL) {
      timer->action.callback.callback(timer);
    }
  }
}
/*---------------------------------------------------------------------------*/
static void
sync_process(uint64_t now)
{
  if(sync_pending && now >= sync_fire_lpticks) {
    sync_pending = false;
    nrf_802154_sl_timestamper_synchronized();
  }
}
/*---------------------------------------------------------------------------*/
void
TIMER20_IRQHandler(void)
{
  bool alarm_forced = (force_isr_mask & FORCE_MASK_ALARM) != 0U;
  bool sync_forced = (force_isr_mask & FORCE_MASK_SYNC) != 0U;
  bool alarm_event = timer_event_check_cc(ALARM_CC);
  bool sync_event = timer_event_check_cc(SYNC_CC);

  if(alarm_event) {
    timer_event_clear_cc(ALARM_CC);
  }
  if(sync_event) {
    timer_event_clear_cc(SYNC_CC);
  }

  force_isr_mask &= ~(FORCE_MASK_ALARM | FORCE_MASK_SYNC);

  if(alarm_forced || alarm_event) {
    alarm_process();
  }

  if(sync_forced || sync_event) {
    sync_process(timer_time_get());
  }
}
/*---------------------------------------------------------------------------*/
void
nrf_802154_platform_sl_lp_timer_init(void)
{
  uint32_t primask;

