contiki-ng/contiki-ng/arch/cpu/nrf/nrf54l15/nrf_802154_platform_sl_lptimer.c
  primask = irq_lock_local();

  alarm_pending = false;
  sync_pending = false;
  critical_section_depth = 0;
  force_isr_mask = 0;
  alarm_target_lpticks = 0;
  sync_fire_lpticks = 0;
  hw_task_state = HW_TASK_STATE_IDLE;
  hw_task_ppi_channel = NRF_802154_SL_HW_TASK_PPI_INVALID;
  hw_task_fire_lpticks = 0;
  timer_time_upper = 0;
  timer_last_low = 0;

  if(!timer_initialized) {
    nrf_timer_task_trigger(LP_TIMER, NRF_TIMER_TASK_STOP);
    nrf_timer_task_trigger(LP_TIMER, NRF_TIMER_TASK_CLEAR);
    nrf_timer_shorts_set(LP_TIMER, 0);
    nrf_timer_mode_set(LP_TIMER, NRF_TIMER_MODE_TIMER);
    nrf_timer_bit_width_set(LP_TIMER, NRF_TIMER_BIT_WIDTH_32);
    nrf_timer_prescaler_set(LP_TIMER, NRF_TIMER_FREQ_1MHz);

    timer_event_clear_cc(ALARM_CC);
    timer_event_clear_cc(SYNC_CC);
    timer_event_clear_cc(HW_TASK_CC);
    timer_compare_int_disable(ALARM_CC);
    timer_compare_int_disable(SYNC_CC);
    nrf_timer_task_trigger(LP_TIMER, NRF_TIMER_TASK_START);

    NVIC_SetPriority(LP_TIMER_IRQn, LP_TIMER_IRQ_PRIORITY);
    NVIC_ClearPendingIRQ(LP_TIMER_IRQn);
    NVIC_EnableIRQ(LP_TIMER_IRQn);

    timer_initialized = true;
  }

  irq_unlock_local(primask);
}
/*---------------------------------------------------------------------------*/
void
nrf_802154_platform_sl_lp_timer_deinit(void)
{
  uint32_t primask = irq_lock_local();

  alarm_pending = false;
  sync_pending = false;
  critical_section_depth = 0;
  force_isr_mask = 0;
  hw_task_state = HW_TASK_STATE_IDLE;
  hw_task_ppi_channel = NRF_802154_SL_HW_TASK_PPI_INVALID;
  hw_task_fire_lpticks = 0;

  if(timer_initialized) {
    timer_compare_int_disable(ALARM_CC);
    timer_compare_int_disable(SYNC_CC);
    timer_event_clear_cc(ALARM_CC);
    timer_event_clear_cc(SYNC_CC);
    timer_event_clear_cc(HW_TASK_CC);
    nrf_timer_task_trigger(LP_TIMER, NRF_TIMER_TASK_STOP);
    nrf_timer_task_trigger(LP_TIMER, NRF_TIMER_TASK_CLEAR);
  }

  irq_unlock_local(primask);
}
/*---------------------------------------------------------------------------*/
uint64_t
nrf_802154_platform_sl_lptimer_current_lpticks_get(void)
{
  return timer_time_get();
}
/*---------------------------------------------------------------------------*/
uint64_t
nrf_802154_platform_sl_lptimer_us_to_lpticks_convert(uint64_t us, bool round_up)
{
  (void)round_up;
  return us;
}
/*---------------------------------------------------------------------------*/
uint64_t
nrf_802154_platform_sl_lptimer_lpticks_to_us_convert(uint64_t lpticks)
{
  return lpticks;
}
/*---------------------------------------------------------------------------*/
void
nrf_802154_platform_sl_lptimer_schedule_at(uint64_t fire_lpticks)
{
  uint32_t primask = irq_lock_local();

  alarm_pending = true;
  alarm_target_lpticks = fire_lpticks;
  (void)timer_compare_set_locked(ALARM_CC, fire_lpticks, false);

  if(critical_section_depth == 0U) {
    timer_compare_int_enable(ALARM_CC);
    if((force_isr_mask & FORCE_MASK_ALARM) != 0U) {
      NVIC_SetPendingIRQ(LP_TIMER_IRQn);
    }
  }

  irq_unlock_local(primask);
}
/*---------------------------------------------------------------------------*/
void
nrf_802154_platform_sl_lptimer_disable(void)
{
  uint32_t primask = irq_lock_local();

  alarm_pending = false;
  alarm_target_lpticks = 0;
  force_isr_mask &= ~FORCE_MASK_ALARM;
  timer_compare_int_disable(ALARM_CC);
  timer_event_clear_cc(ALARM_CC);

  irq_unlock_local(primask);
}
/*---------------------------------------------------------------------------*/
void
nrf_802154_platform_sl_lptimer_critical_section_enter(void)
{
  uint32_t primask = irq_lock_local();

  critical_section_depth++;

  if(critical_section_depth == 1U) {
    timer_compare_int_disable(ALARM_CC);
    timer_compare_int_disable(SYNC_CC);
  }

  irq_unlock_local(primask);
}
/*---------------------------------------------------------------------------*/
void
nrf_802154_platform_sl_lptimer_critical_section_exit(void)
{
  uint32_t primask = irq_lock_local();

  if(critical_section_depth != 0U) {
    critical_section_depth--;
  }

  if(critical_section_depth == 0U) {
    if(sync_pending) {
      timer_compare_int_enable(SYNC_CC);
      if(timer_event_check_cc(SYNC_CC) || ((force_isr_mask & FORCE_MASK_SYNC) != 0U)) {
        NVIC_SetPendingIRQ(LP_TIMER_IRQn);
      }
    }

    if(alarm_pending) {
      timer_compare_int_enable(ALARM_CC);
      if(timer_event_check_cc(ALARM_CC) || ((force_isr_mask & FORCE_MASK_ALARM) != 0U)) {
        NVIC_SetPendingIRQ(LP_TIMER_IRQn);
      }
    }
  }

  irq_unlock_local(primask);
}
/*---------------------------------------------------------------------------*/
nrf_802154_sl_lptimer_platform_result_t
nrf_802154_platform_sl_lptimer_hw_task_prepare(uint64_t fire_lpticks,
                                               uint32_t ppi_channel)
{
  uint32_t primask = irq_lock_local();
  uint64_t now = timer_time_get_locked();
  int rc;

  if(!hw_task_state_set_locked(HW_TASK_STATE_IDLE, HW_TASK_STATE_SETTING_UP)) {
    irq_unlock_local(primask);
    return NRF_802154_SL_LPTIMER_PLATFORM_NO_RESOURCES;
  }

  hw_task_ppi_unbind_locked(hw_task_ppi_channel);
  hw_task_ppi_channel = NRF_802154_SL_HW_TASK_PPI_INVALID;
  hw_task_fire_lpticks = fire_lpticks;
  timer_event_clear_cc(HW_TASK_CC);

  if(target_is_too_distant(now, fire_lpticks)) {
    hw_task_state = HW_TASK_STATE_IDLE;
    irq_unlock_local(primask);
    return NRF_802154_SL_LPTIMER_PLATFORM_TOO_DISTANT;
  }

  rc = timer_compare_set_locked(HW_TASK_CC, fire_lpticks, true);
  if(rc != 0) {
    hw_task_state = HW_TASK_STATE_IDLE;
    irq_unlock_local(primask);
    return NRF_802154_SL_LPTIMER_PLATFORM_TOO_LATE;
  }

  if(hw_task_triggered_check_locked(timer_time_get_locked())) {
    hw_task_state = HW_TASK_STATE_IDLE;
    irq_unlock_local(primask);
    return NRF_802154_SL_LPTIMER_PLATFORM_TOO_LATE;
  }

  hw_task_ppi_bind_locked(ppi_channel);
  hw_task_ppi_channel = ppi_channel;
  hw_task_state = HW_TASK_STATE_READY;

  irq_unlock_local(primask);

  return NRF_802154_SL_LPTIMER_PLATFORM_SUCCESS;
}
/*---------------------------------------------------------------------------*/
nrf_802154_sl_lptimer_platform_result_t
nrf_802154_platform_sl_lptimer_hw_task_cleanup(void)
{
  uint32_t primask = irq_lock_local();

  if(!hw_task_state_set_locked(HW_TASK_STATE_READY, HW_TASK_STATE_CLEANING)) {
    irq_unlock_local(primask);
    return NRF_802154_SL_LPTIMER_PLATFORM_WRONG_STATE;
  }

  timer_event_clear_cc(HW_TASK_CC);
  hw_task_ppi_unbind_locked(hw_task_ppi_channel);
  hw_task_ppi_channel = NRF_802154_SL_HW_TASK_PPI_INVALID;
  hw_task_state = HW_TASK_STATE_IDLE;

  irq_unlock_local(primask);

