contiki-ng/contiki-ng/arch/cpu/nrf/nrf54l15/nrf_802154_platform_sl_lptimer.c
  return NRF_802154_SL_LPTIMER_PLATFORM_SUCCESS;
}
/*---------------------------------------------------------------------------*/
nrf_802154_sl_lptimer_platform_result_t
nrf_802154_platform_sl_lptimer_hw_task_update_ppi(uint32_t ppi_channel)
{
  bool too_late;
  uint32_t primask = irq_lock_local();

  if(!hw_task_state_set_locked(HW_TASK_STATE_READY, HW_TASK_STATE_UPDATING)) {
    irq_unlock_local(primask);
    return NRF_802154_SL_LPTIMER_PLATFORM_WRONG_STATE;
  }

  hw_task_ppi_unbind_locked(hw_task_ppi_channel);
  hw_task_ppi_bind_locked(ppi_channel);
  hw_task_ppi_channel = ppi_channel;
  too_late = hw_task_triggered_check_locked(timer_time_get_locked());
  hw_task_state = HW_TASK_STATE_READY;

  irq_unlock_local(primask);

  return too_late ? NRF_802154_SL_LPTIMER_PLATFORM_TOO_LATE :
         NRF_802154_SL_LPTIMER_PLATFORM_SUCCESS;
}
/*---------------------------------------------------------------------------*/
void
nrf_802154_platform_sl_lptimer_sync_schedule_now(void)
{
  uint32_t primask = irq_lock_local();
  uint64_t now = timer_time_get_locked();

  sync_schedule_locked(now + SYNC_MARGIN_TICKS);

  irq_unlock_local(primask);
}
/*---------------------------------------------------------------------------*/
void
nrf_802154_platform_sl_lptimer_sync_schedule_at(uint64_t fire_lpticks)
{
  uint32_t primask = irq_lock_local();

  sync_schedule_locked(fire_lpticks);

  irq_unlock_local(primask);
}
/*---------------------------------------------------------------------------*/
void
nrf_802154_platform_sl_lptimer_sync_abort(void)
{
  uint32_t primask = irq_lock_local();

  sync_pending = false;
  force_isr_mask &= ~FORCE_MASK_SYNC;
  timer_compare_int_disable(SYNC_CC);
  timer_event_clear_cc(SYNC_CC);

  irq_unlock_local(primask);
}
/*---------------------------------------------------------------------------*/
uint32_t
nrf_802154_platform_sl_lptimer_sync_event_get(void)
{
  return timer_event_address_get(SYNC_CC);
}
/*---------------------------------------------------------------------------*/
uint64_t
nrf_802154_platform_sl_lptimer_sync_lpticks_get(void)
{
  return sync_fire_lpticks;
}
/*---------------------------------------------------------------------------*/
uint32_t
nrf_802154_platform_sl_lptimer_granularity_get(void)
{
  return 1U;
}
/*---------------------------------------------------------------------------*/
void
nrf_802154_sl_timer_module_init(void)
{
  alarm_head = NULL;
  nrf_802154_platform_sl_lp_timer_init();
}
/*---------------------------------------------------------------------------*/
void
nrf_802154_sl_timer_module_uninit(void)
{
  alarm_head = NULL;
}
/*---------------------------------------------------------------------------*/
uint64_t
nrf_802154_sl_timer_current_time_get(void)
{
  return timer_time_get();
}
/*---------------------------------------------------------------------------*/
void
nrf_802154_sl_timer_init(nrf_802154_sl_timer_t *p_timer)
{
  timer_next_set(p_timer, NULL);
  timer_active_set(p_timer, false);
}
/*---------------------------------------------------------------------------*/
void
nrf_802154_sl_timer_deinit(nrf_802154_sl_timer_t *p_timer)
{
  (void)nrf_802154_sl_timer_remove(p_timer);
}
/*---------------------------------------------------------------------------*/
nrf_802154_sl_timer_ret_t
nrf_802154_sl_timer_add(nrf_802154_sl_timer_t *p_timer)
{
  uint32_t primask = irq_lock_local();
  nrf_802154_sl_timer_t *prev = NULL;
  nrf_802154_sl_timer_t *curr = alarm_head;
  uint64_t now = timer_time_get_locked();

  if(target_is_too_distant(now, p_timer->trigger_time)) {
    irq_unlock_local(primask);
    return NRF_802154_SL_TIMER_RET_TOO_DISTANT;
  }

  if(timer_is_active(p_timer)) {
    (void)timer_remove_locked(p_timer);
  }

  while(curr != NULL && curr->trigger_time <= p_timer->trigger_time) {
    prev = curr;
    curr = timer_next_get(curr);
  }

  timer_next_set(p_timer, curr);
  timer_active_set(p_timer, true);

  if(prev == NULL) {
    alarm_head = p_timer;
    alarm_reschedule_locked();
  } else {
    timer_next_set(prev, p_timer);
  }

  irq_unlock_local(primask);

  return NRF_802154_SL_TIMER_RET_SUCCESS;
}
/*---------------------------------------------------------------------------*/
nrf_802154_sl_timer_ret_t
nrf_802154_sl_timer_remove(nrf_802154_sl_timer_t *p_timer)
{
  nrf_802154_sl_timer_ret_t ret;
  uint32_t primask = irq_lock_local();

  ret = timer_remove_locked(p_timer);

  irq_unlock_local(primask);

  return ret;
}
/*---------------------------------------------------------------------------*/
nrf_802154_sl_timer_ret_t
nrf_802154_sl_timer_update_ppi(nrf_802154_sl_timer_t *p_timer, uint32_t ppi_chn)
{
  (void)p_timer;
  (void)ppi_chn;
  return NRF_802154_SL_TIMER_RET_SUCCESS;
}
/*---------------------------------------------------------------------------*/
void
nrf_802154_timer_coord_init(void)
{
}
/*---------------------------------------------------------------------------*/
void
nrf_802154_timer_coord_uninit(void)
{
}
/*---------------------------------------------------------------------------*/
void
nrf_802154_timer_coord_start(void)
{
}
/*---------------------------------------------------------------------------*/
void
nrf_802154_timer_coord_stop(void)
{
}
/*---------------------------------------------------------------------------*/
void
nrf_802154_timer_coord_timestamp_prepare(const nrf_802154_sl_event_handle_t *p_event)
{
  (void)p_event;
}
/*---------------------------------------------------------------------------*/
bool
nrf_802154_timer_coord_timestamp_get(uint64_t *p_timestamp)
{
  (void)p_timestamp;
  return false;
}
/*---------------------------------------------------------------------------*/
